tests/test_01_vw2011/cases/A_Dt57p1_Ha0305_Yfs0356/openfoam/2d/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 6;

method          scotch;
