tests/test_01_vw2011/cases/A_Dt57p1_Ha0305_Yfs0356/openfoam/2d/system/setFieldsDict
/* Initial state from V&W2011 Case A.
   p_air = p_atm + rho*g*0.305; tower water surface is 0.356 m above crown. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue p_rgh 105271.3
    volScalarFieldValue p 105271.3
    volScalarFieldValue T 293.15
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (0.546 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 104311.7
            volScalarFieldValue p 104311.7
        );
    }

    boxToCell
    {
        box (3.48745 0.403 -1) (3.54455 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 101330
            volScalarFieldValue p 101325
        );
    }
);


// ************************************************************************* //
